# Taps
tap 'caskroom/cask'
tap 'caskroom/eid'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'homebrew/php'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# Install more recent versions of some macOS tools
brew 'homebrew/dupes/grep'

# Install Binaries
brew 'cmake'
brew 'git'
brew 'htop'
brew 'mas'
brew 'node'
brew 'python'
brew 'python3'
brew 'tmux'
brew 'trash'
brew 'tree'
brew 'macvim', args: ['with-python3', 'without-python']
brew 'wget'

# Apps
cask 'aerial'
cask 'alfred'
cask 'docker'
cask 'dropbox'
cask 'evernote'
cask 'google-chrome'
cask 'gpgtools'
cask 'iterm2'
cask 'java'
cask 'karabiner-elements'
cask 'mendeley'
cask 'resilio-sync'
cask 'shuttle'
cask 'spotify'
cask 'skype'
cask 'slack'
cask 'vlc'

# Fonts
cask 'font-fira-code'
cask 'font-fira-mono-for-powerline'

# QuickLook Plugins
cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlprettypatch'
cask 'quicklook-csv'
cask 'betterzipql'
cask 'qlimagesize'
cask 'webpquicklook'
cask 'suspicious-package'

# Install Mac App Store apps
mas 'Unsplash Wallpapers', id: 1284863847
